Repository: GnarlyJock45/ENGMUN-website
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Home
ar: الرئيسية

source: Event Details
ar: تفاصيل الحدث

source: Executive Team
ar: الفريق التنفيذي

source: Committee
ar: اللجنة

source: Events
ar: الأحداث

source: Team
ar: الفريق

source: Committees
ar: اللجان

source: Level
ar: المستوى

source: Delegates
ar: ممثلين الدول

source: Experience
ar: الخبرة

source: Study Guide
ar: دليل الدراسة

source: Download
ar: تحميل

source: About the Committee
ar: حول اللجنة

source: Topics
ar: المواضيع

source: Resources
ar: الموارد

source: FOR
ar: لـ

source: SCIENCE
ar: للعلوم

source: AND
ar: و

source: ENGINEERING
ar: الهندسة

source: Our Vision
ar: رؤيتنا

source: Leading in developing a generation of engineers capable of facing global challenges through innovation and international cooperation.
ar: بناء جيل قادر على مواجهة التحديات العالمية من خلال الابتكار والتعاون

source: Why EngMUN?
ar: لماذا EngMUN؟

source: Build a Professional Network
ar: بناء شبكة علاقات مهنية

source: Network with future leaders to expand your career horizons
ar: تواصل مع قادة المستقبل لتوسيع آفاقك المهنية

source: Enhance Diplomacy
ar: تعزيز مهارات الدبلوماسية والقيادة

source: Develop your abilities in negotiation, debating, and problem-solving
ar: طوّر مهاراتك في التفاوض، النقاش، وحل المشكلات

source: Innovative Problem Solving
ar: إيجاد حلول مبتكرة

source: Contribute creative solutions to real global challenges
ar: ساهم في طرح حلول خلاقة لتحديات عالمية حقيقية

source: First in Region
ar: أول مؤتمر من نوعه في المنطقة!

source: Message from SG
ar: رسالة من الأمين العام

source: message from sg content
ar: “مؤتمر محاكاة الأمم المتحدة (MUN) ليس مجرد حدث عابر، بل هو مساحة تنبض بالإلهام وتجمع العقول لصناعة التغيير. في EngMUN، نلتقي بشغف لنتبادل الأفكار، نواجه التحديات، ونبتكر حلولًا ترسم ملامح مستقبل أفضل. انضم الينا، واجعل صوتك جزءًا من الحكاية.

source: secretary general
ar: لما الجبر، الأمين العام

source: Meet the Executive Team
ar: تعرف على الفريق التنفيذي

source: Our dedicated team works tirelessly to ensure the success of the EngMUN events, showcasing passion and expertise in every aspect.
ar: يعمل فريقنا المكرس بلا كلل لضمان نجاح فعاليات EngMUN، معروضًا الشغف والخبرة في كل جانب.

source: View Team
ar: عرض الفريق

source: Resources you need
ar: مصادر تهمك

source: Delegate Guide
ar: دليل ممثلين الدول

source: Detailed guidelines for participation as a Delegate.
ar: إرشادات مفصلة للمشاركة كممثل دولة

source: Download PDF
ar: تحميل الملف

source: Chair Guide
ar: دليل قائد اللجنة

source: Detailed guidelines for participation as a Chair.
ar: إرشادات مفصلة للمشاركة كقائد لجنة

source: View Guide
ar: اقرأ المزيد

source: dialogue_language
ar: لغة الحوار

source: coming soon
ar: يتوفر قريبا
